src/cfe/КСП/DataProcessors/КСП_ДиспетчерРаспределенияГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КСП_ДиспетчерРаспределенияГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеКаналы</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОпт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРозница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеECOM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИсходныхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИсходныхДанныхКаналы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИсходныхДанныхКомплекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтборовСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтборовСКДКаналы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтборовСКДКомплекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикКаналы</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикКомплекты</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПродаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоКомплектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаспределенияГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_ВидРаспределенияГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеКомплекты</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеПодразделения</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеМагазины</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИсходныхДанныхПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИсходныхДанныхМагазины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтборовСКДПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтборовСКДМагазины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикПодразделения</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикМагазины</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьECOMВРамкахРозницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемникРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентОПТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентРозница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентECOM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиентаОпт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиентаРозница</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиентаECOM</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиентаРегиональныеПодразделения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОПТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеРозница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеECOM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ВидРаспределенияГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ВидРаспределенияГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииПоНаправлениямПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииНаУровнеМагазинов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииСвободныйОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииОптРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/DataProcessors/КСП_ДиспетчерРаспределенияГотовойПродукции/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем мСтрокаРаспределенияДоИзменения;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРаспределения) Тогда
		Объект.ДатаРаспределения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	Объект.АдресИсходныхДанных = ОбработкаОбъект.НовыйАдресИсходныхДанных(УникальныйИдентификатор);
	Объект.АдресОтборовСКД = ОбработкаОбъект.НовыйАдресОтборовСКД(УникальныйИдентификатор);
	ОбработкаОбъект.ИнициализироватьКомпоновщик(Объект.Компоновщик);
	
	Объект.АдресИсходныхДанныхКаналы = ОбработкаОбъект.НовыйАдресИсходныхДанныхКаналы(УникальныйИдентификатор);
	Объект.АдресОтборовСКДКаналы = ОбработкаОбъект.НовыйАдресОтборовСКДКаналы(УникальныйИдентификатор);	
	ОбработкаОбъект.ИнициализироватьКомпоновщикКаналы(Объект.КомпоновщикКаналы);
	
	Объект.АдресИсходныхДанныхКомплекты = ОбработкаОбъект.НовыйАдресИсходныхДанныхКомплекты(УникальныйИдентификатор);
	Объект.АдресОтборовСКДКомплекты = ОбработкаОбъект.НовыйАдресОтборовСКДКомплекты(УникальныйИдентификатор);	
	ОбработкаОбъект.ИнициализироватьКомпоновщикКомплекты(Объект.КомпоновщикКомплекты);
	
	//Объект.ИсточникРаспределения = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Опт");
	Объект.ВидРаспределенияГотовойПродукции = Перечисления.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж;
	ТекущаяСтраница = "СтраницаРаспределениеПоПланамПродаж";
	
	Объект.РаспределятьECOMВРамкахРозницы = ОбработкаОбъект.ПолучитьНастройкуРаспределенияECOM();
	
КонецПроцедуры   


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастройкиОтбора = СохраненныеНастройки("Отборы", НастройкиОтбораКлюч);
	Если ТипЗнч(НастройкиОтбора) = Тип("НастройкиКомпоновкиДанных") Тогда
		Объект.Компоновщик.ЗагрузитьНастройки(НастройкиОтбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладОстатковПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладОстатков) Тогда
		Объект.Распределение.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиЭлементОтбор

&НаКлиенте
Процедура КомпоновщикНастройкиЭлементОтборПриИзменении(Элемент)
	
	ТребуетсяПрименитьОтбор = Истина;
	Элементы.РаспределениеПрименитьОтбор.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределение

&НаКлиенте
Процедура РаспределениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.Уровень = 0
		И Поле = Элементы.РаспределениеНоменклатура Тогда
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломИзменения(Элемент, Отказ)
	
	мСтрокаРаспределенияДоИзменения = Новый Структура(
		"КоличествоДоступно,
		|КоличествоДоступноОпт, КоличествоДоступноРозница, КоличествоДоступноECOM");
	ЗаполнитьЗначенияСвойств(мСтрокаРаспределенияДоИзменения, Элементы.РаспределениеГоризонтальное.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноОптПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноРозницаПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноECOMПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	//Если ТекущаяСтраница = "СтраницаРаспределениеПоПланамПродаж" Тогда	
	//	ЗаписатьРаспределение();
	//ИначеЕсли ТекущаяСтраница = "СтраницаРаспределениеПоКаналам" Тогда
	//	ЗаписатьРаспределениеПоКаналам();
	//КонецЕсли;
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		
		ЗаписатьРаспределение();
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
				
		ЗаписатьРаспределениеПоКаналам();
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
				
		ЗаписатьРаспределениеПоОптовымКлиентам();
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		ЗаписатьРаспределениеПоМагазинам();		
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьДанные(Команда)

	//Если ТекущаяСтраница = "СтраницаРаспределениеПоПланамПродаж" Тогда	
	//	
	//	ЗаполнитьРаспределение(); 
	//	
	//ИначеЕсли ТекущаяСтраница = "СтраницаРаспределениеПоКаналам" Тогда
	//	
	//	ЗаполнитьРаспределениеПоКаналам();
	//	
	//КонецЕсли;
	
	//Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.СтраницаРаспределение;
	
	//++ Зайцева Инна 
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		
		ЗаполнитьРаспределение(); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
				
		ЗаполнитьРаспределениеПоКаналам(); 
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
				
		ЗаполнитьРаспределениеПоОптовымКлиентам(); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		ЗаполнитьРаспределениеПоМагазинам(); 
		
	КонецЕсли;
	
	//++ Зайцева Инна 
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПрименитьОтбор(Команда = Неопределено)
	
	Если НЕ Элементы.ГруппаОтборы.Скрыта() Тогда
		Элементы.ГруппаОтборы.Скрыть();
	КонецЕсли;
	
	ПрименитьОтборНаСервере();
	
	ТребуетсяПрименитьОтбор = Ложь;
	Элементы.РаспределениеЗаписатьИзменения.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборНаСервере()
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщика();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ОтключитьЭлементыОтбора(Объект.Компоновщик.Настройки.Отбор);
	
	Для Каждого ГруппировкаНоменклатура Из Объект.Компоновщик.Настройки.Структура Цикл
		ОтключитьЭлементыОтбора(ГруппировкаНоменклатура.Отбор);
		Для Каждого ГруппировкаХарактеристика Из ГруппировкаНоменклатура.Структура Цикл
			ОтключитьЭлементыОтбора(ГруппировкаХарактеристика.Отбор);
		КонецЦикла;
	КонецЦикла;
	
	ПрименитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиОтбора(Команда)
	ИспользоватьНастройкиОтбора(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиОтбора(Команда)
	ИспользоватьНастройкиОтбора(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотОбъект()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Процедура ЗаполнитьРаспределение()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	//ОбработкаОбъект.ТекущееРаспределениеНовое(); 
	
	ОбработкаОбъект.ВыполнитьРаспределениеПоКаналамПродаж();	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщика(Истина);
	
	//Проверяем распределение по комплектам 
	//Если ОбработкаОбъект.РаспределятьПоКомплектам Тогда 
	//	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаКомплекты(Истина);
	//Иначе
	//	ОбработкаОбъект.ПрименитьНастройкиКомпоновщика(Истина); 
	//КонецЕсли;  
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры  


&НаСервере
Процедура ЗаполнитьРаспределениеПоКаналам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ТекущееРаспределениеПоКаналам();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаКаналы(Истина);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРаспределениеПоКомплектам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ТекущееРаспределениеПоКаналам();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаКаналы(Истина);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспределениеПоОптовымКлиентам()
	
		
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	//ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаКаналы(Истина);

	ОбработкаОбъект.ТекущееРаспределениеПоОптовымКлиентам();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаПоОптовымКлиентам(Истина);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРаспределениеПоМагазинам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ТекущееРаспределениеПоМагазинам();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаПоМагазинам(Истина);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры  


&НаСервере
Процедура ЗаписатьРаспределение()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	Если ОбработкаОбъект.ЗаписатьРаспределение() Тогда
		ЗаполнитьРаспределение();
	КонецЕсли;
	
КонецПроцедуры  


&НаСервере
Процедура ЗаписатьРаспределениеПоКаналам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	//Если ОбработкаОбъект.ЗаписатьРаспределениеПоКаналам() Тогда
	Если ОбработкаОбъект.ЗаписатьРаспределениеПоМагазинам() Тогда
		ЗаполнитьРаспределениеПоКаналам();
	КонецЕсли;
	
КонецПроцедуры  


&НаСервере
Процедура ЗаписатьРаспределениеПоОптовымКлиентам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	Если ОбработкаОбъект.ЗаписатьРаспределениеПоОптовымКлиентам() Тогда
		ЗаполнитьРаспределениеПоОптовымКлиентам();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьРаспределениеПоМагазинам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	Если ОбработкаОбъект.ЗаписатьРаспределениеПоМагазинам() Тогда
		ЗаполнитьРаспределениеПоМагазинам();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьРаспределениеПоКомплектам()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	Если ОбработкаОбъект.ЗаписатьРаспределениеПоКомплектам() Тогда
		ЗаполнитьРаспределениеПоКомплектам();
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура КоличествоДоступноПриИзменении(ПолеВводаКоличество)
	
	//Поля = ИменаСвязанныхПолей(ПолеВводаКоличество);
	//
	//// Поле "%КоличествоДоступно%" у текущей строки и строки-родителя
	//
	//ТекущиеДанные = Элементы.РаспределениеГоризонтальное.ТекущиеДанные;
	//СтрокаРодитель = ТекущиеДанные.ПолучитьРодителя();
	//
	//НовоеКоличество = ТекущиеДанные[Поля.Доступно];
	//ПредКоличество = мСтрокаРаспределенияДоИзменения[Поля.Доступно];
	//
	//Дельта = НовоеКоличество - ПредКоличество;
	//
	//ТекущиеДанные.КоличествоДоступно = ТекущиеДанные.КоличествоДоступно - Дельта;
	//СтрокаРодитель[Поля.Доступно] = СтрокаРодитель[Поля.Доступно] + Дельта;
	//
	//мСтрокаРаспределенияДоИзменения[Поля.Доступно] = НовоеКоличество;
	//
	//// Поле "%ПроцентОбеспечения%" у текущей строки и строки-родителя
	//
	//Если ТекущиеДанные[Поля.План] = 0 Тогда
	//	ТекущиеДанные[Поля.Процент] = 0;
	//Иначе
	//	ТекущиеДанные[Поля.Процент] =
	//		100 * (ТекущиеДанные[Поля.Распределено] + НовоеКоличество) / ТекущиеДанные[Поля.План];
	//КонецЕсли;
	//
	//Если СтрокаРодитель[Поля.План] = 0 Тогда
	//	СтрокаРодитель[Поля.Процент] = 0;
	//Иначе
	//	СтрокаРодитель[Поля.Процент] =
	//		100 * (СтрокаРодитель[Поля.Распределено] + НовоеКоличество) / СтрокаРодитель[Поля.План];
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаСвязанныхПолей(ПолеВводаКоличество)
	
	ИмяТаблицыФормы = "Распределение";
	
	// Поле "%КоличествоДоступно%"
	ИмяПоляКоличество = СтрЗаменить(ПолеВводаКоличество.Имя, ИмяТаблицыФормы, "");
	
	ИмяТипаПодразделения			= СтрЗаменить(ИмяПоляКоличество, "КоличествоДоступно", "");  // "Опт", "Розница" и т.д.
	ИмяПоляКоличествоПлановое		= "КоличествоПлановое"		+ ИмяТипаПодразделения;
	ИмяПоляКоличествоРаспределено	= "КоличествоРаспределено"	+ ИмяТипаПодразделения;
	ИмяПоляПроцентОбеспечения		= "ПроцентОбеспечения"		+ ИмяТипаПодразделения;
	
	СвязанныеПоля = Новый Структура;
	СвязанныеПоля.Вставить("Доступно",		ИмяПоляКоличество);
	СвязанныеПоля.Вставить("План",			ИмяПоляКоличествоПлановое);
	СвязанныеПоля.Вставить("Распределено",	ИмяПоляКоличествоРаспределено);
	СвязанныеПоля.Вставить("Процент",		ИмяПоляПроцентОбеспечения);
	
	Возврат СвязанныеПоля;
	
КонецФункции

&НаКлиенте
Функция ОтключитьЭлементыОтбора(Отбор)
	
	Для Каждого Элемент Из Отбор.Элементы Цикл
		Элемент.Использование = Ложь;
	КонецЦикла;
	
КонецФункции

#Область УправлениеНастройками

&НаСервере
Функция НастройкиКомпоновщика()
	Возврат Объект.Компоновщик.ПолучитьНастройки();
КонецФункции

&НаСервереБезКонтекста
Функция СохраненныеНастройки(Назначение, КлючНастроек)
	
	МенеджерОбработки = Обработки.КСП_ДиспетчерРаспределенияГотовойПродукции;
	
	// Сначала ищем в личных настройках
	ОписаниеНастроек = МенеджерОбработки.ОписаниеНастроек(Назначение, КлючНастроек);
	
	Если ТипЗнч(ОписаниеНастроек) <> Тип("ОписаниеНастроек") Тогда
		// Если не нашли в личных - ищем в общих настройках
		ОписаниеНастроек = МенеджерОбработки.ОписаниеНастроек(Назначение, КлючНастроек, Истина);
	КонецЕсли;
	
	Настройки = Неопределено;
	Если ТипЗнч(ОписаниеНастроек) = Тип("ОписаниеНастроек") Тогда
		Настройки = МенеджерОбработки.ЗагрузитьНастройки(ОписаниеНастроек);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

&НаСервере
Функция ИмяФормыНастроек()
	Возврат ЭтотОбъект().Метаданные().ПолноеИмя() + ".Форма.ФормаНастроек";
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастроек(Назначение, ИмяМетодаОбработчика, Настройки = Неопределено, Сохранение = Ложь)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Назначение",	Назначение);
	ПараметрыОткрытия.Вставить("Сохранение",	Сохранение);
	
	Если Сохранение Тогда
		ПараметрыОткрытия.Вставить("Настройки",	Настройки);
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения(ИмяМетодаОбработчика, ЭтотОбъект, ПараметрыОткрытия);
	
	ОткрытьФорму(ИмяФормыНастроек(), ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНастройкиОтбора(Сохранение)
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		
		Если Объект.РаспределятьПоКомплектам Тогда
			
			ОткрытьФормуНастроек(
			"ОтборыКомплекты", "ПриЗакрытииФормыНастроекОтборов",
			НастройкиКомпоновщика(),
			Сохранение); 
			
		Иначе  
			
			ОткрытьФормуНастроек(
			"Отборы", "ПриЗакрытииФормыНастроекОтборов",
			НастройкиКомпоновщика(),
			Сохранение);

		КонецЕсли;

		//ОткрытьФормуНастроек(
		//"Отборы", "ПриЗакрытииФормыНастроекОтборов",
		//НастройкиКомпоновщика(),
		//Сохранение); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
				
		ОткрытьФормуНастроек(
		"ОтборыКаналы", "ПриЗакрытииФормыНастроекОтборов",
		НастройкиКомпоновщика(),
		Сохранение);
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
				
		ОткрытьФормуНастроек(
		"ОтборыПоОптовымКлиентам", "ПриЗакрытииФормыНастроекОтборов",
		НастройкиКомпоновщика(),
		Сохранение); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		ОткрытьФормуНастроек(
		"ОтборыПоМагазинам", "ПриЗакрытииФормыНастроекОтборов",
		НастройкиКомпоновщика(),
		Сохранение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыНастроекОтборов(ОписаниеНастроек, ПараметрыОткрытия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОписаниеНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтбораКлюч = ОписаниеНастроек.КлючНастроек;
	
	Если НЕ ПараметрыОткрытия.Сохранение Тогда
		Объект.Компоновщик.ЗагрузитьНастройки(ОписаниеНастроек.Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИсточникРаспределенияПриИзменении(Элемент)
	
	//Элементы.КаналыСписок.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура КаналыСписокКоличествоРаспределеноПриИзмененииНаСервере(ДанныеВыбор) 
	
	Попытка 
		ГруппировкаСтроки = ДанныеВыбор.ГруппировкаСтроки;
		ЭтоГруппировка = Истина;
	Исключение
		ЭтоГруппировка = Ложь;
	КонецПопытки;	
		
	Если Не ЭтоГруппировка Тогда
		
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Это группировка";
		Сообщение.Сообщить();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КаналыСписокКоличествоРаспределеноПриИзменении(Элемент) 
	
	ДанныеВыбор = Элемент.ТекущиеДанные;	
	КаналыСписокКоличествоРаспределеноПриИзмененииНаСервере(ДанныеВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЭтаФорма.ТекущаяСтраница = ТекущаяСтраница.Имя; 
	
	Элементы.ПоНаправлениямПродаж.Видимость = Ложь;
	Элементы.ПоКаналам.Видимость = Ложь;
	Элементы.ПоКлиентамПодразделений.Видимость = Ложь;
	Элементы.ПоМагазинам.Видимость = Ложь; 
	Элементы.ГруппаПерераспределениеОптРозница.Видимость = Ложь;
	
	Если ТекущаяСтраница.Имя = "СтраницаРаспределениеПоПланамПродаж" Тогда 
		
		Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж");	
		Элементы.ПоНаправлениямПродаж.Видимость = Истина;   
		
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаРаспределениеПоКаналам" Тогда 
		
		Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений");
		Элементы.ПоКаналам.Видимость = Истина;  
		
    ИначеЕсли ТекущаяСтраница.Имя = "СтраницаРаспределениеПоОптовымКлиентамПодразделений" Тогда 
		
		Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений");	
		Элементы.ПоКлиентамПодразделений.Видимость = Истина;
		
	ИначеЕсли  ТекущаяСтраница.Имя = "СтраницаРаспределениеГотовойПродукцииНаУровнеМагазинов" Тогда
		
		Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов");		
		Элементы.ПоМагазинам.Видимость = Истина;
		
	ИначеЕсли  ТекущаяСтраница.Имя = "СтраницаДокументыРеализации" Тогда
		
	    ЗаполнитьЗаказыКлиентов();     
		
	ИначеЕсли  ТекущаяСтраница.Имя = "ПерераспределениеОптРозница" Тогда	
		
		Элементы.ГруппаПерераспределениеОптРозница.Видимость = Истина;
		
	КонецЕсли;
	
	Объект.РаспределениеКаналы.ПолучитьЭлементы().Очистить();
	Объект.Распределение.ПолучитьЭлементы().Очистить(); 
	ОчиститьТаблицы(); 
	
	Элементы.РаспределениеКаналы.Обновить();
	ОбновитьОтображениеДанных(Элементы.ПанельОсновная);

КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьЗаказыКлиентов()
	
	ОбработкаОбъект = ЭтотОбъект();
	ТаблицаЗаказы = ОбработкаОбъект.НайтиЗаказыКлиентов(Объект.ИсточникРаспределения, "	И ЗаказКлиента.Подразделение = &Канал");
	 
	Для каждого СтрокаТЧ из ТаблицаЗаказы Цикл  
		
		НоваяСтрокаТЧ = ЭтотОбъект.ТаблицаЗаказыКлиентовДляРеализации.Добавить();
		
		ДокументРеализация = ПроверитьСуществующиеДокументыРеализация(СтрокаТЧ.Ссылка);
		
		Если Не ДокументРеализация = Неопределено Тогда
			НоваяСтрокаТЧ.ДокументРеализация = ДокументРеализация[0].Ссылка;
		КонецЕсли;
		
		НоваяСтрокаТЧ.ЗаказКлиента = СтрокаТЧ.Ссылка; 
		
	КонецЦикла;
	
КонецПроцедуры

//Распределение по каналам продаж 

&НаСервере
Процедура ОбъектРаспределениеКаналыКолРаспределеноПриИзмененииНаСервере(НомерСтроки)
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");              
	ТекущаяСтрока = ОбъектФормы.РаспределениеКаналы.Строки.Найти(НомерСтроки, "НомерЗаписи", Истина);
	ТекущееКоличество = ТекущаяСтрока.КолРаспределено;

	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Коллекция", ТекущаяСтрока.Коллекция);
	ПараметрыОтбора.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	ПараметрыОтбора.Вставить("Характеристика", ТекущаяСтрока.Характеристика);
	НайденныеСтроки = ОбъектФормы.РаспределениеКаналы.Строки.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Элемент Из НайденныеСтроки Цикл 
		Если Элемент.КолКРаспределению <= ТекущееКоличество Тогда
			
			Если Элемент.НомерЗаписи = НомерСтроки Тогда 
				Элемент.КолРаспределено = ТекущееКоличество;
			КонецЕсли;	
			
			Элемент.КолКРаспределению = 0;
		Иначе
			Элемент.КолКРаспределению = Элемент.КолКРаспределению - ТекущееКоличество;			
		КонецЕсли;
		Элемент.РаспределеноПроц = (Элемент.КолРаспределено / Элемент.КолЗаказано) * 100;
		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ОбъектРаспределениеКаналыКолРаспределеноПриИзменении(Элемент) 
	
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Распределять = Истина; 	
	
	ОбъектРаспределениеКаналыКолРаспределеноПриИзмененииНаСервере(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборКаналы(Команда = Неопределено)
	
	Если НЕ Элементы.ГруппаОтборыКаналы.Скрыта() Тогда
		Элементы.ГруппаОтборыКаналы.Скрыть();
	КонецЕсли;
	
	ПрименитьОтборКаналыНаСервере();
	
	ТребуетсяПрименитьОтбор = Ложь;
	Элементы.РаспределениеЗаписатьИзменения.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ПрименитьОтборКаналыНаСервере()

	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ПрименитьНастройкиКомпоновщикаКаналы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры	


&НаКлиенте
Процедура ОтключитьОтборКаналы(Команда)
	
	ОтключитьЭлементыОтбора(Объект.КомпоновщикКаналы.Настройки.Отбор);
	
	Для Каждого ГруппировкаНоменклатура Из Объект.КомпоновщикКаналы.Настройки.Структура Цикл
		ОтключитьЭлементыОтбора(ГруппировкаНоменклатура.Отбор);
		Для Каждого ГруппировкаХарактеристика Из ГруппировкаНоменклатура.Структура Цикл
			ОтключитьЭлементыОтбора(ГруппировкаХарактеристика.Отбор);
		КонецЦикла;
	КонецЦикла;
	
	ПрименитьОтборКаналы();
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьНастройкиОтбораКаналы(Команда)
	ИспользоватьНастройкиОтбораКаналы(Истина);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьНастройкиОтбораКаналы(Команда)
	ИспользоватьНастройкиОтбораКаналы(Ложь);
КонецПроцедуры 


&НаКлиенте
Процедура ИспользоватьНастройкиОтбораКаналы(Сохранение)
	
	ОткрытьФормуНастроек(
		"Отборы", "ПриЗакрытииФормыНастроекОтборовКаналы",
		НастройкиКомпоновщикаКаналы(),
		Сохранение);
	
КонецПроцедуры                     


&НаСервере
Функция НастройкиКомпоновщикаКаналы()
	Возврат Объект.КомпоновщикКаналы.ПолучитьНастройки();
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыНастроекОтборовКаналы(ОписаниеНастроек, ПараметрыОткрытия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОписаниеНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтбораКлюч = ОписаниеНастроек.КлючНастроек;
	
	Если НЕ ПараметрыОткрытия.Сохранение Тогда
		Объект.КомпоновщикКаналы.ЗагрузитьНастройки(ОписаниеНастроек.Настройки);
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ТестКомплектыНаСервере()

	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Объект.ИсточникРаспределения); 
	Запрос.Текст =  "ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Ссылка,
	|	&Родитель КАК Родитель
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Родитель = &Родитель";

		 
	ТаблицаВыгрузка = Запрос.Выполнить().Выгрузить(); 
			
	ЕстСтрока = "олло";
		
	ЕстСтрока = "олло";	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестКомплекты(Команда)
	ТестКомплектыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРаспределятьПоКомплектамПриИзменении(Элемент)
	Элементы.РаспределениеКомплект.Видимость = Объект.РаспределятьПоКомплектам;
КонецПроцедуры


&НаКлиенте
Процедура ОбъектВидРаспределенияГотовойПродукцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
	//	 
	//	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеПоПланамПродаж"); 
	//		
	//ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
	//			
	//	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеКаналы");
	//	
	//ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
	//			
	//	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений");
	//		
	//ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
	//			
	//	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеГотовойПродукцииНаУровнеМагазинов"); 
	//		
	//КонецЕсли;


	//ОбновитьОтображениеДанных(Элементы.ПанельОсновная);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВидРаспределенияГотовойПродукцииПриИзменении(Элемент)
	
	ВидимостьЭлементовФормы();	
	
КонецПроцедуры  

&НаКлиенте
Процедура ВидимостьЭлементовФормы()

	Элементы.ПоНаправлениямПродаж.Видимость = Ложь;
	Элементы.ПоКаналам.Видимость = Ложь;
	Элементы.ПоКлиентамПодразделений.Видимость = Ложь;
	Элементы.ПоМагазинам.Видимость = Ложь; 
	Элементы.СвободныйОстаток.Видимость = Ложь;   
	Элементы.ГруппаПерераспределениеОптРозница.Видимость = Ложь; 
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		 
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеПоПланамПродаж"); 
		Элементы.ПоНаправлениямПродаж.Видимость = Истина;  
		Элементы.ПодразделениеECOM.Видимость = НЕ Объект.РаспределятьECOMВРамкахРозницы;
	    Элементы.РаспределениеГруппаПланECOM.Видимость = НЕ Объект.РаспределятьECOMВРамкахРозницы;
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
		
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеПоКаналам");
		Элементы.ПоКаналам.Видимость = Истина;

	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
		
		//Объект.РаспределениеКаналы.Очистить();
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеПоОптовымКлиентамПодразделений");
		Элементы.ПоКлиентамПодразделений.Видимость = Истина;
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("СтраницаРаспределениеГотовойПродукцииНаУровнеМагазинов"); 
		Элементы.ПоМагазинам.Видимость = Истина; 
		Элементы.ПодразделениеECOMРозница.Видимость = Объект.РаспределятьECOMВРамкахРозницы;
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииСвободныйОстаток") Тогда	
				
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("РаспределениеСвободныйОстаток"); 
		Элементы.СвободныйОстаток.Видимость = Истина;   
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииОптРозница") Тогда	
				
		Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.ПодчиненныеЭлементы.Найти("ПерераспределениеОптРозница"); 
		Элементы.ГруппаПерераспределениеОптРозница.Видимость = Истина; 	
		
	КонецЕсли;
	
	Объект.РаспределениеКаналы.ПолучитьЭлементы().Очистить();
	Объект.Распределение.ПолучитьЭлементы().Очистить(); 
	ОчиститьТаблицы(); 
	
	Элементы.РаспределениеКаналы.Обновить();
	ОбновитьОтображениеДанных(Элементы.ПанельОсновная);
	
КонецПроцедуры

Процедура ОчиститьТаблицы()
	
	ОбработкаОбъект = ЭтотОбъект();
	ЭтотОбъект.РежимТрехКолонокКаналы = Ложь;
	ОбработкаОбъект.ОчиститьТаблицыРаспределения();

КонецПроцедуры

&НаКлиенте
Процедура РежимТрехКолонокКаналыПриИзменении(Элемент)
	
	Элементы.РаспределениеКаналы.Видимость = Не ЭтотОбъект.РежимТрехКолонокКаналы;
	Элементы.КаналыРежимТрехКолонок.Видимость = ЭтотОбъект.РежимТрехКолонокКаналы;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимТрехКолонокКаналыРаспределениеПоКлиентамПриИзменении(Элемент)
	
	//Элементы.РаспределениеКаналы.Видимость = Не ЭтотОбъект.РежимТрехКолонокКаналы;
	//Элементы.КаналыРежимТрехКолонок.Видимость = ЭтотОбъект.РежимТрехКолонокКаналы;
	
КонецПроцедуры


&НаКлиенте
Процедура РаспределитьДоступныйОстаток(Команда)
	 
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		
		РаспределитьДоступныйОстатокПоНаправлениям(); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
				
		РаспределитьДоступныйОстатокПоКаналам(); 
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
				
		РаспределитьДоступныйОстатокПоОптовымКлиентам(); 
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		РаспределитьДоступныйОстатокПоМагазинам(); 
		
	КонецЕсли;

КонецПроцедуры

Процедура РаспределитьДоступныйОстатокПоНаправлениям()
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.РаспределитьДоступныйОстатокПоНаправлениям();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");  
	
КонецПроцедуры

Процедура РаспределитьДоступныйОстатокПоКаналам()

	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.РаспределитьДоступныйОстатокПоКаналам();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");   
	
КонецПроцедуры

Процедура РаспределитьДоступныйОстатокПоОптовымКлиентам()

	//ОбработкаОбъект = ЭтотОбъект();
	//
	//ОбработкаОбъект.РаспределитьДоступныйОстатокПоОптовымКлиентам();
	//	
	//ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");  
	//                                                    
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.РаспределитьДоступныйОстатокПоКаналам();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");   
	
КонецПроцедуры

Процедура РаспределитьДоступныйОстатокПоМагазинам()

	ОбработкаОбъект = ЭтотОбъект();
	
	//ОбработкаОбъект.РаспределитьДоступныйОстатокПоМагазинам();   
	ОбработкаОбъект.РаспределитьДоступныйОстатокПоКаналам();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");  
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиРаспределенияECOM(Команда)  
	
	ОткрытьФорму("Обработка.КСП_ДиспетчерРаспределенияГотовойПродукции.Форма.ФормаНастройкаРаспределенияECOM");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОТПНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктураПредприятия.Ссылка КАК ОТП
	               |ИЗ
	               |	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	               |ГДЕ
	               |	СтруктураПредприятия.Родитель = &Родитель"; 
	
	Запрос.Параметры.Вставить("Родитель", Объект.ИсточникРаспределения); 
	
	ТаблицаОТП = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого СтрокаОТП из  ТаблицаОТП Цикл      
		
		СтрокаТЧ = ЭтотОбъект.ТаблицаОТПДляРаспределения.Добавить();
		СтрокаТЧ.ОТП = СтрокаОТП.ОТП; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОТП(Команда)
	ЗаполнитьОТПНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьСвободныйСкладНаСервере()
	
	ОбработкаОбъект = ЭтотОбъект();
	
	ОбработкаОбъект.ТекущееРаспределениеСвободныйОстаток(ЭтотОбъект.ТаблицаОТПДляРаспределения.Выгрузить(,));  
	ОбработкаОбъект.РаспределитьСвободныйОстаток();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект"); 
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСвободныйСклад(Команда)
	РаспределитьСвободныйСкладНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыРаспределенияНаСервере()
	
	Если Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииПоНаправлениямПродаж") Тогда	
		
		ЗаписатьРаспределение();
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеРегиональныхПодразделений") Тогда	
				
		ЗаписатьРаспределениеПоКаналам();
		
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеОптовыхКлиентовПодразделений") Тогда	
				
		ЗаписатьРаспределениеПоОптовымКлиентам();
			
	ИначеЕсли Объект.ВидРаспределенияГотовойПродукции = ПредопределенноеЗначение("Перечисление.КСП_ВидРаспределенияГотовойПродукции.РаспределениеГотовойПродукцииНаУровнеМагазинов") Тогда	
				
		ЗаписатьРаспределениеПоМагазинам();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыРаспределения(Команда)
	СформироватьДокументыРаспределенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерераспределениеОптРозницаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПерераспределениеОптРозница(Команда)
	ПерераспределениеОптРозницаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыРеализацииНаСервере()

	Для каждого СтрокаРеализации из ЭтотОбъект.ТаблицаЗаказыКлиентовДляРеализации Цикл
		
		ДокументыРеализация = ПроверитьСуществующиеДокументыРеализация(СтрокаРеализации.ЗаказКлиента);
		
		Если  ДокументыРеализация = Неопределено Тогда
			ДокументРеализацияНовый = СоздатьДокументРеализация(СтрокаРеализации.ЗаказКлиента);
		Иначе
			ДокументРеализацияНовый = ДокументыРеализация[0].Ссылка;
		КонецЕсли;  
		
		СтрокаРеализации.ДокументРеализация = ДокументРеализацияНовый;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыРеализации(Команда)
	
	СформироватьДокументыРеализацииНаСервере();
	Элементы.ТаблицаЗаказыКлиентовДляРеализации.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРаспределенияДолей(Команда)
	
	ОткрытьФорму("Обработка.КСП_РасчетДолейДляРаспределенияСвободногоОстатка.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОПотребности(Команда)
	
	ОткрытьФорму("Отчет.КСП_ПотребностиПоДатеВозникновенияИОбъему.Форма.ФормаОтчета");
	
КонецПроцедуры


Функция ПроверитьСуществующиеДокументыРеализация(ЗаказКлиента) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.ЗаказКлиента = &Основание";
	
	Запрос.Параметры.Вставить("Основание",ЗаказКлиента); 
	
	ТаблицаДокументыРеализации = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДокументыРеализации.Количество() >0 Тогда
		 Возврат ТаблицаДокументыРеализации;
	Иначе
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СоздатьДокументРеализация(ЗаказКлиента)  
	
	ДокументРеализацияТоваров = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ДокументРеализацияТоваров.Заполнить(ЗаказКлиента);

	ДокументРеализацияТоваров.Записать(РежимЗаписиДокумента.Запись);
	
КонецФункции

&НаСервере
Процедура СоздатьЗаказКлиентаДляПерераспределенияНаСервере()
	
	
	НовыйЗаказКлиента = Документы.ЗаказКлиента.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйЗаказКлиента, Объект.ЗаказКлиента, ,"Номер");
	НовыйЗаказКлиента.Подразделение = Объект.ПриемникРаспределения;
	НовыйЗаказКлиента.КСП_Канал = Объект.ПриемникРаспределения;
	
	//Заполняем товары в новом документе
	
	ЗаказКлиентаОбъект = Объект.ЗаказКлиента.ПолучитьОбъект(); 
	ЗаказКлиентаОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТЧ из ЭтотОбъект.ТаблицаНоменклатураДляПерераспределения Цикл
		
		СтрокаДокумента = Объект.ЗаказКлиента.Товары.Найти(СтрокаТЧ.НомерСтроки,"НомерСтроки");
		
		Если СтрокаТЧ.Распределять Тогда
			
			НоваяСтрокаТЧ = НовыйЗаказКлиента.Товары.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаДокумента); 
			НоваяСтрокаТЧ.Количество = СтрокаТЧ.КоличествоПерераспределить;
			НоваяСтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоПерераспределить;
			
		КонецЕсли; 
		
		
		Если Не СтрокаТЧ.Количество = СтрокаТЧ.КоличествоПерераспределить Тогда
				
			НоваяСтрокаТЧ = ЗаказКлиентаОбъект.Товары.Добавить(); 	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаДокумента); 
			НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоПерераспределить;
			НоваяСтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоПерераспределить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НовыйЗаказКлиента.Записать(РежимЗаписиДокумента.Запись);
	ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ЭтотОбъект.ТаблицаНоменклатураДляПерераспределения.Очистить();
	
	//Перезаписываем старый документ
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуТовары(ТаблицаИсточник, ТаблицаПриемник)

	Для Каждого СтрокаТЧ из Объект.ЗаказКлиента.Товары Цикл
		
		НоваяСтрокаТЧ = ЭтотОбъект.ТаблицаНоменклатураДляПерераспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЧ); 
		
	КонецЦикла
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаказКлиентаДляПерераспределения(Команда)
	СоздатьЗаказКлиентаДляПерераспределенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектЗаказКлиентаПриИзмененииНаСервере()
	
	ЭтотОбъект.ТаблицаНоменклатураДляПерераспределения.Очистить();
	
	Для Каждого СтрокаТЧ из Объект.ЗаказКлиента.Товары Цикл
		
		НоваяСтрокаТЧ = ЭтотОбъект.ТаблицаНоменклатураДляПерераспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЧ); 
		
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЗаказКлиентаПриИзменении(Элемент)
	ОбъектЗаказКлиентаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказыКлиентов(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СоздатьРазделениеСтроки()

	//ТЗТест = Новый ТаблицаЗначений;
	//ТЗТест.д	
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
